spec/support/vcr_cassettes/hca/health_check.yml

---
http_interactions:
- request:
    method: post
    uri: https://es-dev/voa/voaSvc?wsdl
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="http://va.gov/schema/esr/voa/v1"
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://va.gov/service/esr/voa/v1"><soap:Body><ns1:retrieveFormSubmissionStatusRequest><ns1:formSubmissionId>377609264</ns1:formSubmissionId></ns1:retrieveFormSubmissionStatusRequest></soap:Body></soap:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Date:
      - Tue, 20 Aug 2024 16:38:44 GMT
      Content-Length:
      - '472'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 20 Aug 2024 16:38:44 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Content-Security-Policy:
      - 'default-src https: data: ''unsafe-inline'' ''unsafe-eval'''
      X-Oracle-Dms-Rid:
      - '0'
      X-Oracle-Dms-Ecid:
      - c2c62aca-191c-42ad-bad8-dbbd9c5271ad-0015d9ad
      X-Oneagent-Js-Injection:
      - 'true'
      Ssl-Env:
      - 'On'
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Cache-Control:
      - max-age=0, no-store
      Server-Timing:
      - dtSInfo;desc="0", dtRpid;desc="151202451"
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><retrieveFormSubmissionStatusResponse
        xmlns="http://va.gov/schema/esr/voa/v1" xmlns:ns0="http://jaxws.webservices.esr.med.va.gov/schemas"><formSubmissionId>377609264</formSubmissionId><message/><timeStamp>2024-08-20T11:38:44.535-05:00</timeStamp></retrieveFormSubmissionStatusResponse></S:Body></S:Envelope>
  recorded_at: Tue, 20 Aug 2024 16:38:44 GMT
recorded_with: VCR 6.2.0
